import React from 'react';
interface LeafIconProps {
  width?: string;
}
const LeafIcon: React.FC<LeafIconProps> = ({ width }) => {
  const style = {
    width: width || '100px', // Если width не указан, то устанавливаем значение по умолчанию '100px'
  };
  return (
<svg
      id="Слой_1"
      viewBox="0 0 419.6 420"
      preserveAspectRatio="xMidYMid meet"
      style={{ fill: '#ffffff', ...style }} // Объединяем стили с fill и width
    >
  <circle cx="209.8" cy="209.8" r="209.8" fill="green" />
<path d="M49.8,279.1c30.7-75.1,76.9-135.4,157.6-162.5c-16.5-2.5-33-0.4-49.2,4.4c-31,9.2-57,27-80.7,48.4c-28.1,25.3-51.4,54.4-71.4,86.4c-0.9,1.4-1.7,2.7-3.8,4c-0.7-8.2-1.7-16.3-2-24.5c-2.8-60.6,11-116.3,49.3-164.6c27.8-35,64.5-55.5,107.6-65.1c34.8-7.8,69.8-6.6,104.8-1.5c30,4.4,59.8,9.6,89.8,13.7c21.9,3,43.9,2.5,65.5-3.1c0.5-0.1,1,0,2.2,0c-1.6,7.9-3.1,15.7-4.7,23.4c-9.1,41.9-21.1,82.9-40.3,121.4c-17.6,35.4-40.6,66.4-73.4,89.4c-29.6,20.7-62.8,31.7-98.2,36.5c-39.9,5.4-79.8,3.7-119.6-0.6c-10.7-1.2-21.4-2.5-32.2-3.8C50.7,280.4,50.3,279.8,49.8,279.1z" transform="translate(107,145) scale(0.50)"></path></svg>
 );
};

export default LeafIcon;